lib/tasks/article_populate.rake

  task :create => :environment do
    p "criando artigo"
    articles = ClientSpaceFlightNews.get_articles

    articles.map do |article|
      begin
        Article.create!(
          featured: article["featured"],
          title: article["title"],
          url: article["url"],
          imageUrl: article["imageUrl"],
          newSite: article["newSite"],
          summary: article["summary"],
          publishedAt: article["publishedAt"],
          launches: article["launches"],
          events: article["events"]
        )
---
INSERT INTO "articles" ("title", "url", "imageUrl", "summary", "publishedAt", "launches", "events", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"