app/controllers/v1/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    articles = Article.all

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def view
    article = Article.find(params[:id])

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "Testando diretamente do insomnia"], ["updated_at", "2021-12-02 02:02:14.629249"], ["id", 1]]
---
  def update
    article = Article.find(params[:id])

    article.update!(article_params)

INSERT INTO "articles" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Criando uma API supinpa com a Lais"], ["created_at", "2021-12-02 02:12:13.683001"], ["updated_at", "2021-12-02 02:12:13.683001"]]
---
  def create
    article = Article.create!(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 1]]
---
  def delete
    article = Article.find(params[:id])

    article.delete